Repository: MidnightCommander/mc
Catalog: po/*.po
Languages: uk

source: Emacs key:
uk: Клав╕ша Emacs:

source: Execute Macro
uk: Виконати макрос

source: Press macro hotkey:
uk: Натисн╕ть клав╕шу макросу:

source: Insert Literal
uk: Вставити л╕терал

source: Press any key:
uk: Натисн╕ть клав╕шу:

source: Unable to execute "%s". Please check it to see if it points to a valid command.
uk: Неможливо виконати "%s". Перев╕рте, будь ласка, чи вказу╓ це посилання на в╕рну команду.

source: ". To fix this, bring up the mime-properties editor in the GNOME Control Center, and edit the default %s-action for "%s".
uk: ". Для виправлення, запуст╕ть редактор mime-властивостей в Центр╕ Керування GNOME, та виправте типову %s-д╕ю для "%s".

source: ". To fix this error, bring up this file's properties and change the default %s-action.
uk: ". Для виправлення, в╕дкрийте д╕алог властивостей файлу та зм╕н╕ть типову %s-д╕ю.

source: Unable to %s "%s" with the command: "%s"%s
uk: Неможливо %s "%s" командою: "%s"%s

source: open
uk: в╕дкрити

source: edit
uk: редагувати

source: view
uk: переглядати

source: Could not start a terminal
uk: Не вдалось запустити терм╕нал

source: The Midnight Commander Team
uk: Команда розробник╕в Midnight Commander

source: bug reports: http://bugs.gnome.org, or use gnome-bug
uk: про помилки пов╕домляйте: http://bugs.gnome.org, or use gnome-bug

source: The GNOME edition of the Midnight Commander file manager.
uk: Редакц╕я Midnight Commander для GNOME.

source: Sort By
uk: Сортувати за

source: Ignore case sensitivity.
uk: ╤гнорувати рег╕стр.

source: Sort files by
uk: Сортувати файли за

source: Name
uk: Назва

source: File Type
uk: Тип

source: Size
uk: Розм╕р

source: Time Last Accessed
uk: Часом останнього доступу

source: Time Last Modified
uk: Часом останньо╖ модиф╕кац╕╖

source: Time Last Changed
uk: Часом останньо╖ зм╕ни

source: Reverse the order.
uk: Зм╕нити порядок

source: Enter name.
uk: Введ╕ть назву.

source: Enter label for command:
uk: Введ╕ть м╕тку для команди:

source: Find all core files
uk: Знайти вс╕ core-файли

source: Run Command
uk: Запустити команду

source: Preset Commands
uk: Заготован╕ команди

source: Add
uk: Додати

source: Remove
uk: Вилучити

source: Run this Command
uk: Запустити цю команду

source: Command:
uk: Команда:

source: Set Filter
uk: Встановити ф╕льтр

source: Show all files
uk: Показати вс╕ файли

source: Enter a filter here for files in the panel view. For example: *.png will show just png images
uk: Введ╕ть ф╕льтр для вибирання файл╕в у панель. Наприклад: *.png вибере вс╕ png зображення

source: Enter a Regular Expression to filter files in the panel view.
uk: Введ╕ть ре╜улярний вираз для ф╕льтрування файл╕в у панел╕.

source: Open with...
uk: В╕дкрити за допомогою...

source: Enter extra arguments:
uk: Введ╕ть додатков╕ аргументи:

source: Desktop entry properties
uk: Властивост╕ елементу робочого столу

source: Select File
uk: Вибрати файл

source: Enter a filter here to select files in the panel view with. For example: *.png will select all png images
uk: Введ╕ть ф╕льтр для вибирання файл╕в у панель. Наприклад: *.png вибере вс╕ png зображення

source: Malformed regular expression
uk: Погано сформований ре╜улярний вираз

source: Creating a desktop link
uk: Сворення посилання на робочому стол╕

source: Enter the URL:
uk: Введ╕ть URL:

source: Access Time
uk: Час доступу

source: Creation Time
uk: Час створення

source: Group
uk: Група

source: Group ID
uk: ╤дентиф╕катор групи

source: Inode Number
uk: Номер I-вузла

source: Mode
uk: Режим

source: Modification Time
uk: Час модиф╕кац╕╖

source: Number of Hard Links
uk: К╕льк╕сть жорстких посилань

source: Owner
uk: Власник

source: Permission
uk: Права

source: Size (short)
uk: Розм╕р (коротко)

source: Type
uk: Тип

source: User ID
uk: ╤дентиф╕катор користувача

source: Possible Columns
uk: Можлив╕ стовпчики

source: Displayed Columns
uk: Показуван╕ стовпчики

source: Custom View
uk: Нетипове в╕дображення

source: Home directory
uk: Домашн╕й каталог

source: Icon position
uk: Позиц╕я п╕ктограми

source: Automatic icon placement
uk: Автоматичне розм╕щення п╕ктограм

source: Snap icons to grid
uk: При╓днувати п╕ктограми до с╕тки

source: Use shaped icons
uk: Використовувати вир╕зан╕ п╕ктограми

source: Use shaped text
uk: Використовувати вир╕заний текст

source: Desktop
uk: Робочий ст╕л

source: Warning
uk: Попередження

source: While running the mount/umount command
uk: При виконанн╕ команди mount/umount

source: While running the eject command
uk: При виконанн╕ команди eject

source: Error
uk: Помилка

source: _Terminal
uk: Терм╕нал

source: Launch a new terminal in the current directory
uk: Запустити терм╕нал в поточному каталогу

source: _Directory...
uk: Каталог...

source: Creates a new directory
uk: Створити новий каталог

source: URL L_ink...
uk: Посилання на URL...

source: Creates a new URL link
uk: Створю╓ нове посилання на URL

source: _Launcher...
uk: Запускач...

source: Creates a new launcher
uk: Створити новий запускач

source: By _Name
uk: За назвою

source: By File _Type
uk: За типом файлу

source: By _Size
uk: За розм╕ром

source: By Time Last _Accessed
uk: За часом останнього доступу

source: By Time Last _Modified
uk: За часом останньо╖ модиф╕кац╕╖

source: By Time Last _Changed
uk: За часом останньо╖ зм╕ни

source: _Arrange Icons
uk: Впорядкувати п╕ктограми

source: Create _New Window
uk: Створити нове в╕кно

source: Rescan _Desktop Directory
uk: Пересканувати каталог користувача

source: Rescan De_vices
uk: Пересканувати пристро╖

source: Recreate Default _Icons
uk: В╕дновити типов╕ п╕ктограми

source: Configure _Background Image
uk: Сконф╕╜урувати зображення на тл╕

source: Des_ktop Properties
uk: Властивост╕ робочого столу

source: To:
uk: В:

source: Copying from:
uk: Коп╕ювання з:

source: Deleting file:
uk: Видалення файлу:

source: Files Exist
uk: Файли ╕снують

source: Some of the files you are trying to copy already exist in the destination folder. Please select the action to be performed.
uk: Деяк╕ файли, що ви пробу╓те скоп╕ювати вже ╕снують у каталоз╕ призначення. Будь ласка, вибер╕ть одну ╕з запропонованих д╕й.

source: Prompt me before overwriting any file.
uk: Перепитування перед зам╕щенням будь-яких файл╕в.

source: Don't overwrite any files.
uk: Не зам╕щати н╕яких файл╕в.

source: Overwrite:
uk: Зам╕стити:

source: Older files.
uk: Стар╕ файли.

source: Files only if size differs.
uk: Файли, що в╕др╕зняються за розм╕ром.

source: All files.
uk: Вс╕ файли:

source: File Exists
uk: Файл ╕сну╓

source: The target file already exists: %s
uk: Ц╕льовий файл вже ╕сну╓: %s

source: Replace it?
uk: Зам╕нити його?

source: Copy
uk: Коп╕ювати

source: Move
uk: Перенести

source: Destination
uk: М╕сце призначення

source: Find Destination Folder
uk: Пошук м╕сця призначення

source: Copy as a background process
uk: Коп╕ювати в процес╕ на тл╕

source: Advanced Options
uk: Додатков╕ параметри

source: Preserve symlinks
uk: Збер╕гати символьн╕ посилання

source: Follow links.
uk: Роз╕меновувати посилань

source: Selecting this will copy the files that symlinks point to instead of just copying the link.
uk: Коп╕ювати файли на як╕ вказують посилання зам╕сть посилань

source: Preserve file attributes.
uk: Збер╕гати атрибути файл╕в.

source: Preserves the permissions and the UID/GID if possible
uk: Збер╕гати права та UID/GID якщо можливо

source: Recursively copy subdirectories.
uk: Рекурсивно коп╕ювати каталоги

source: If set, this will copy the directories recursively
uk: Рекурсивно коп╕ювати каталоги

source: %s Directory not empty. Delete it recursively?
uk: %s Каталог не порожн╕й. Стерти його рекурсивно?

source: Delete:
uk: Стерти:

source: Do the same for the rest
uk: Робити те ж саме для ╕нших

source: Move Progress
uk: Поступ переносу

source: Copy Progress
uk: Поступ коп╕ювання

source: Delete Progress
uk: Поступ видалення

source: Password:
uk: Пароль:

source: Password
uk: Пароль

source: Symbolic Link
uk: Символьне посилання

source: Existing filename (filename symlink will point to):
uk: Назва ╕снуючого файлу (на який буде вказувати посилання):

source: Symbolic link filename:
uk: Назва символьного посилання:

source: Domain:
uk: Домен:

source: Username:
uk: ╤м'я користувача:

source: Password:
uk: Пароль:

source: Password for \\%s\%s
uk: Пароль для \\%s\%s

source: _Move here
uk: Перенести сюди

source: _Copy here
uk: Скоп╕ювати сюди

source: _Link here
uk: Послатись сюди

source: Cancel drag
uk: Перервати перетягування

source: Could not stat %s %s
uk: Неможливо отримати властивост╕ %s %s

source: Start at:
uk: Починати з:

source: Filename:
uk: Назва файлу:

source: Content:
uk: Вм╕ст:

source: Find File
uk: Пошук файлу

source: Grepping in %s
uk: Пошук в %s

source: Problem reading from child
uk: Проблема зчитування з нащадка

source: Finished
uk: Завершено

source: Searching %s
uk: Пошук %s

source: Suspend
uk: Зупинити

source: Restart
uk: Перезапустити

source: Stopped
uk: Зупинено

source: Searching
uk: Пошук

source: Find file
uk: Пошук файлу

source: Change to this directory
uk: Перейти в цей каталог

source: Search again
uk: Шукати знову

source: View this file
uk: Переглянути цей файл

source: Edit this file
uk: Редагувати цей файл

source: Send the results to a Panel
uk: В╕д╕слати результат на панель

source: _Icon View
uk: П╕ктограми

source: Switch view to an icon display
uk: Показ п╕ктограм

source: _Brief View
uk: Коротко

source: Switch view to show just file name and type
uk: Показ лише назви та тип╕в файл╕в

source: _Detailed View
uk: Детально

source: Switch view to show detailed file statistics
uk: Показ детально╖ файлово╖ статистики

source: _Custom View
uk: Нетипово

source: Switch view to show user-defined statistics
uk: Показ визначено╖ користувачем статистики

source: Icons
uk: П╕ктограми

source: Brief
uk: Коротко

source: Detailed
uk: Детально

source: Custom
uk: Нетипово

source: Enter command to run
uk: Введ╕ть команду для виконання

source: _File...
uk: Файл...

source: Creates a new file in this directory
uk: Створити новий файл в цьому каталоз╕

source: _Copy...
uk: Коп╕ювати...

source: Copy files
uk: Коп╕ювати файли

source: _Delete...
uk: _Стерти...

source: Delete files
uk: Стерти файли

source: _Move...
uk: _Перем╕стити...

source: Rename or move files
uk: Перейменувати чи перем╕стити файли

source: Show directory sizes
uk: Показати розм╕ри каталог╕в

source: Shows the disk space used by each directory
uk: Показати розм╕р дискового простору використаного кожним каталогом

source: Close window
uk: Закрити в╕кно

source: Closes this window
uk: Закрива╓ це в╕кно

source: Select _All
uk: Вибрати все

source: Select all files in the current Panel
uk: Вибрати вс╕ файли в поточн╕й панел╕

source: _Select Files...
uk: Вибрати файли...

source: Select a group of files
uk: Вибрати групу файл╕в

source: _Invert Selection
uk: ╤нвертувати виб╕р

source: Reverses the list of tagged files
uk: ╤нвертувати виб╕р файл╕в

source: Search
uk: Пошук

source: Search for a file in the current Panel
uk: Шукати файл в поточн╕й панел╕

source: _Rescan Directory
uk: Пересканувати каталог

source: Rescan the directory contents
uk: Пересканувати вм╕ст каталогу

source: _Sort By...
uk: Сортувати за...

source: _Filter View...
uk: Ф╕льтрований перегляд...

source: _Find File...
uk: Шукати файл...

source: Locate files on disk
uk: Знайти файли на диску

source: _Edit mime types...
uk: Редагувати MIME-типи...

source: Edits the MIME type bindings
uk: Редагувати прив'язки до MIME-тип╕в

source: _Run Command...
uk: Виконати команду

source: Runs a command
uk: Виконати команду

source: _Run Command in panel...
uk: Виконати команду в панел╕...

source: Run a command and put the results in a panel
uk: Виконати команду ╕ розм╕стити результат в панел╕

source: _Background jobs...
uk: Завдання на тл╕...

source: List of background operations
uk: Список операц╕й на тл╕

source: Exit
uk: Вийти

source: Terminates the file manager and the desktop
uk: Завершити роботу файлового менеджера ╕ робочого столу

source: _Settings
uk: Установки

source: _Layout
uk: Схема розташування

source: _Commands
uk: Команди

source: _Desktop
uk: Робочий ст╕л

source: _Help
uk: Дов╕дка

source: Could not contact the file manager
uk: Не вдалось з'╓днатись з менеджером файл╕в

source: Could not get the desktop
uk: Не вдалось отримати робочий ст╕л

source: Unknown arrange type `%s'
uk: Нев╕домий тип впорядкування - "%s"

source: Create window showing the specified directory
uk: Створити в╕кно, що показу╓ вказаний каталог

source: DIRECTORY
uk: КАТАЛОГ

source: Rescan the specified directory
uk: Пересканувати вказаний каталог

source: Rescan the desktop icons
uk: Пересканувати п╕ктограми на робочому стол╕

source: Rescan the desktop device icons
uk: Пересканувати п╕ктограми пристро╖в на робочому стол╕

source: Arrange the desktop icons
uk: Впорядкувати п╕ктограми на робочому стол╕

source: name | type | size | atime | mtime | ctime
uk: назва | тип | розм╕р | часд | часм | часс

source: Close windows whose directories cannot be reached
uk: Закрити в╕кна недосяжних каталог╕в

source: Could not open the /etc/fstab file
uk: Неможливо в╕дкрити файл /etc/fstab

source: Floppy %d
uk: Флоп╕ %d

source: Disk %d
uk: Диск %d

source: NFS dir %s
uk: NFS-каталог %s

source: Device %d
uk: Пристр╕й %d

source: Full Name:
uk: Повна назва:

source: File Name
uk: Назва файлу

source: File Type:
uk: Тип файлу:

source: File Type: Symbolic Link
uk: Тип файлу: Символьне посилання

source: Target Name: INVALID LINK
uk: Назва ориг╕налу: НЕВ╤РНЕ ПОСИЛАННЯ

source: Target Name:
uk: Назва ориг╕налу:

source: File Type: Directory
uk: Тип файлу: Каталог

source: File Type: Character Device
uk: Тип файлу: Символьний пристр╕й

source: File Type: Block Device
uk: Тип файлу: Блоковий пристр╕й

source: File Type: Socket
uk: Тип файлу: Сокет

source: File Type: FIFO
uk: Тип файлу: FIFO

source: File Size:
uk: Розм╕р файлу:

source: bytes
uk: байт╕в

source: KBytes (
uk: КБайт╕в (

source: bytes)
uk: байт╕в)

source: MBytes (
uk: МБайт╕в (

source: File Size: N/A
uk: Розм╕р файлу: Н/Д

source: File Created on:
uk: Файл створено:

source: Last Modified on:
uk: Файл зм╕нено:

source: Last Accessed on:
uk: Останн╕й доступ:

source: Caption:
uk: П╕дпис:

source: View
uk: Переглянути

source: Use default View options
uk: Використовувати типовий перегляд

source: Select an Icon
uk: Вибер╕ть п╕ктограму

source: Open
uk: В╕дкрити

source: Use default Open action
uk: Використовувати типове в╕дкриття

source: Use default View action
uk: Використовувати типовий перегляд

source: Edit
uk: Виправити

source: Use default Edit action
uk: Використовувати типове редагування

source: Icon
uk: П╕ктограма

source: File Actions
uk: Д╕╖ над файлом

source: Open action
uk: В╕дкриття

source: Needs terminal to run
uk: Виконання в терм╕нал╕

source: File Permissions
uk: Права доступу до файлу

source: Current mode:
uk: Поточн╕ права:

source: Read
uk: Зчитування

source: Write
uk: Запис

source: Exec
uk: Виконання

source: Special
uk: Спец╕альн╕

source: User
uk: Користувач

source: Other
uk: ╤нш╕

source: Set UID
uk: Встановлення UID

source: Set GID
uk: Встановлення GID

source: Sticky
uk: Закр╕плення

source: File ownership
uk: Волод╕ння файлом

source: Statistics
uk: Статистика

source: Options
uk: Параметри

source: Permissions
uk: Права

source: Properties
uk: Властивост╕

source: You entered an invalid username
uk: Ви ввели нев╕рне ╕м'я користувача

source: You must rename your file to something
uk: Необх╕дно перейменувати ваш файл

source: Select an application to open "%s" with.
uk: Вибер╕ть програму для в╕дкриття нею "%s".

source: Select a file to run with
uk: Вибер╕ть файл запуску

source: Applications
uk: Програми

source: Program to run
uk: Запустити програму

source: Mount device
uk: Змонтувати пристр╕й

source: Unmount device
uk: Демонтувати пристр╕й

source: Eject device
uk: Витягти пристр╕й

source: Empty Trash
uk: Очистити см╕тник

source: Open with...
uk: В╕дкрити за допомогою...

source: View Unfiltered
uk: Неф╕льтрований перегляд

source: Copy...
uk: Коп╕ювання...

source: Move to Trash
uk: Перенести в см╕тник

source: Delete
uk: Стерти

source: Move...
uk: Перенести...

source: Hard Link...
uk: Жорстке посилання...

source: Symlink...
uk: Символьне посилання...

source: Edit Symlink...
uk: Зм╕нити символьне посилання...

source: Properties...
uk: Властивост╕...

source: Show backup files
uk: Показати резервн╕ коп╕╖

source: Show hidden files
uk: Показати прихован╕ файли

source: Mix files and directories
uk: Сум╕ш файл╕в та каталог╕в

source: Use shell patterns instead of regular expressions
uk: Використовувати шаблони оболонки зам╕сть ре╜улярних вираз╕в

source: Determine file types from file content instead of extensions
uk: Визначати типи файл╕в з ╖х вм╕сту зам╕сть розширень

source: Confirm when deleting file
uk: П╕дтвердження на видалення файлу

source: Confirm when overwriting files
uk: П╕дтвердження на зам╕щення файлу

source: Confirm when executing files
uk: П╕дтвердження на виконання файлу

source: Show progress while operations are being performed
uk: Показати поступ виконання операц╕й

source: VFS Timeout:
uk: Тайм-аут ВФС:

source: Seconds
uk: Секунд

source: Anonymous FTP password:
uk: Пароль для анон╕много FTP:

source: Always use FTP proxy
uk: Завжди використовувати FTP-прокс╕

source: Fast directory reload
uk: Швидке перевантаження каталогу

source: Compute totals before copying files
uk: Порахувати загальний розм╕р перед коп╕юванням

source: FTP directory cache timeout :
uk: Тайм-аут кеша каталогу FTP:

source: Confirmation
uk: П╕дтвердження

source: VFS
uk: ВФС

source: Caching
uk: Кешування

source: Preferences
uk: Установки

source: Reloads the current directory
uk: Перезавантажу╓ поточний каталог

source: New _Directory...
uk: Новий _каталог...

source: Creates a new directory here
uk: Створю╓ тут новий каталог

source: Empty _Trash
uk: Очистити см╕тник

source: Search: %s
uk: Пошук: %s

source: %s bytes in %d file
uk: %s байт╕в в %d файл╕

source: %s bytes in %d files
uk: %s байт╕в в %d файлах

source: <readlink failed>
uk: <зб╕й зчитування посилання>

source: Copy directory
uk: Скоп╕ювати каталог

source: Delete directory
uk: Стерти каталог

source: Rename or move directory
uk: Перейменувати чи перенести каталог

source: Back
uk: Назад

source: Go to the previously visited directory
uk: Перейти в попередн╕й каталог

source: Up
uk: Вгору

source: Go up a level in the directory hierarchy
uk: П╕днятись на один р╕вень в ╕╓рарх╕╖ каталог╕в

source: Forward
uk: Вперед

source: Go to the next directory
uk: Перейти в наступний каталог

source: Rescan
uk: Оновити

source: Rescan the current directory
uk: Пересканувати поточний каталог

source: Home
uk: Дом╕вка

source: Go to your home directory
uk: Перейти у ваш домашн╕й каталог

source: Location:
uk: Розм╕щення:

source: &Ok
uk: Гаразд

source: Offset 0x%08lx
uk: Зм╕щення 0x%08lx

source: Col %d
uk: Стовпчик %d

source: %s bytes
uk: %s байт

source: _Goto line
uk: _Перейти на рядок

source: Jump to a specified line number
uk: Перескочити на вказаний рядок

source: _Monitor file
uk: Мон╕торинг файлу

source: Monitor file growing
uk: Мон╕торинг зб╕льшення файлу

source: Regexp search
uk: Пошук за ре╜улярним виразом

source: Regular expression search
uk: Пошук за ре╜улярним виразом

source: _Wrap
uk: Переноси

source: Wrap the text
uk: З переносами тексту

source: _Parsed view
uk: Анал╕зований

source: _Formatted
uk: Форматований

source: _Hex
uk: Ш╕стнадцятковий

source: _Search
uk: _Шукати

source: ok
uk: гаразд

source: cancel
uk: в╕дм╕на

source: help
uk: дов╕дка

source: yes
uk: так

source: no
uk: н╕

source: exit
uk: вих╕д

source: abort
uk: припинити

source: Error
uk: Помилка

source: Failed trying to open file for reading:
uk: Помилка при спроб╕ в╕дкрити файл для зчитування:

source: Error reading from pipe:
uk: Помилка зчитування з каналу:

source: Failed trying to open pipe for reading:
uk: Помилка на спроб╕ в╕дкрити канал для зчитування:

source: Error reading file:
uk: Помилка зчитування файлу:

source: Not an ordinary file:
uk: Незвичайний файл:

source: File is too large:
uk: Файл надто великий:

source: Increase edit.h:MAXBUF and recompile the editor.
uk: Зб╕льш╕ть значення edit.h:MAXBUF та перекомп╕люйте редактор.

source: User menu available only in mcedit invoked from mc
uk: Меню користувача доступне лише в mcedit викликаному з mc

source: Error trying to stat file:
uk: Помилка на спроб╕ отримання атрибут╕в файлу:

source: &Dismiss
uk: Закрити

source: Error writing to pipe:
uk: Помилка запису в канал:

source: Failed trying to open pipe for writing:
uk: Помилка на спроб╕ в╕дкрити файл для запису:

source: Quick save
uk: Швидке збереження

source: Safe save
uk: Безпечне збереження

source: Do backups -->
uk: Робити резервн╕ коп╕╖ -->

source: &Cancel
uk: В╕дм╕на

source: Extension:
uk: Розширення:

source: Edit Save Mode
uk: Редагування режиму збереження

source: Save As
uk: Зберегти як

source: Warning
uk: Попередження

source: A file already exists with this name.
uk: Файл з ц╕╓ю назвою вже ╕сну╓.

source: Overwrite
uk: Зам╕стити

source: Cancel
uk: В╕дм╕на

source: Save as
uk: Зберегти як

source: Error trying to save file.
uk: Помилка на спроб╕ зберегти файл.

source: Delete macro
uk: Стерти макрос

source: Error trying to open temp file
uk: Помилка на спроб╕ в╕дкрити тимчасовий файл

source: Error trying to open macro file
uk: Помилка при спроб╕ в╕дкрити файл макрос╕в

source: Error trying to overwrite macro file
uk: Помилка при спроб╕ зам╕стити файл макрос╕в

source: Macro
uk: Макрос

source: Press the macro's new hotkey:
uk: Натисн╕ть нову клав╕шу макросу:

source: Save macro
uk: Зберегти макрос

source: Delete Macro
uk: Стерти макрос

source: Load macro
uk: Завантажити макрос

source: Confirm save file? :
uk: П╕дтверд╕ть збереження файлу :

source: Save file
uk: Збереження файлу

source: Save
uk: Запис

source: Current text was modified without a file save. Continue discards these changes.
uk: Поточний текст було модиф╕ковано ╕ не збережено. Продовження призведе до втрати цих зм╕н.

source: Continue
uk: Продовжити

source: Load
uk: Завантаження

source: Block is large, you may not be able to undo this action.
uk: Блок надто великий, ви не зможете зробити в╕дкат ц╕╓╖ д╕╖.

source: Continue
uk: Продовжити

source: Cancel
uk: В╕дм╕на

source: o&Ne
uk: Один

source: al&L
uk: Вс╕

source: &Skip
uk: Пропустити

source: &Replace
uk: Зам╕нити

source: Replace with:
uk: Зам╕нити на:

source: Confirm replace
uk: П╕дтвердження зам╕ни

source: scanf &Expression
uk: Вираз scanf

source: replace &All
uk: Зам╕нити все

source: pr&Ompt on replace
uk: П╕дтвердження

source: &Backwards
uk: Назад

source: &Regular expression
uk: Ре╜улярний вираз

source: &Whole words only
uk: Лише слова

source: case &Sensitive
uk: Врахування рег╕стру

source: Enter replacement argument order eg. 3,2,1,4
uk: Введ╕ть порядок аргумент╕в зам╕ни, напр. 3,2,1,4

source: Enter replacement string:
uk: Введ╕ть рядок для зам╕ни:

source: Enter search string:
uk: Введ╕ть рядок для пошуку:

source: Replace
uk: Зам╕на

source: Search
uk: Пошук

source: Enter search text :
uk: Введ╕ть текст для пошуку :

source: Enter replace text :
uk: Введ╕ть текст для зам╕ни :

source: You can enter regexp substrings with %s (not \1, \2 like sed) then use "Enter...order"
uk: Ви можете ввести ре╜улярний вираз з %s (не \1, \2 як в sed), пот╕м використати "Ввести...порядок"

source: Enter argument (or substring) order :
uk: Введ╕ть порядок аргумент╕в (чи п╕дрядк╕в):

source: Enter the order of replacement of your scanf format specifiers or regexp substrings, eg 3,1,2
uk: Введ╕ть порядок зам╕ни ваших специф╕катор╕в формату scanf чи п╕дрядк╕в regexp, наприклад 3,1,2

source: Whole words only
uk: Лише слова

source: Case sensitive
uk: Чутлив╕сть до ре╜╕стру

source: Regular expression
uk: Ре╜улярний вираз

source: Backwards
uk: Назад
