Repository: MidnightCommander/mc
Catalog: po/*.po
Languages: uk

source: &Rename/Move F6
uk: &Перейменувати/Перенести F6

source: &Mkdir F7
uk: &Створити каталог F7

source: &Delete F8
uk: &Стерти F8

source: &Quick cd M-c
uk: &Швидка зм╕на каталогу M-c

source: select &Group M-+
uk: Вибрати &групу M-+

source: u&Nselect group M-\
uk: &Зняти виб╕р з групи M-\

source: reverse selec&Tion M-*
uk: &╤нвертувати виб╕р M-*

source: e&Xit F10
uk: Завершити F10

source: &Directory tree
uk: &Дерево каталог╕в

source: &Find file M-?
uk: &Шукати файл M-?

source: s&Wap panels C-u
uk: &Обм╕няти панел╕ C-u

source: switch &Panels on/off C-o
uk: Ввмк/вимк &панел╕ C-o

source: &Compare directories C-x d
uk: &Пор╕вняти каталоги C-x d

source: show directory s&Izes
uk: Показати &розм╕ри каталог╕в

source: command &History
uk: &╤стор╕я команд

source: di&Rectory hotlist C-\
uk: &П╕дручн╕ каталоги C-\

source: &Active VFS list C-x a
uk: Список активних &ВФС C-x a

source: Fr&ee VFSs now
uk: З&в╕льнити ВФС

source: &Background jobs C-x j
uk: Завдання на &тл╕ C-x j

source: &Undelete files (ext2fs only)
uk: &В╕дновлення файл╕в (лише ext2fs)

source: &Listing format edit
uk: Виправлення формату списку

source: &Extension file edit
uk: Редагувати файл &розширень

source: &Menu file edit
uk: Редагувати файл &меню

source: &Configuration...
uk: &Конф╕гурац╕я...

source: c&Onfirmation...
uk: &П╕дтвердження...

source: &Display bits...
uk: &В╕дображення б╕т╕в...

source: learn &Keys...
uk: Розп╕знавання &клав╕ш...

source: &Virtual FS...
uk: &В╕ртуальна файлова система...

source: &Save setup
uk: &Зберегти установки

source: &Above
uk: &Верхня

source: &Left
uk: &Л╕ва

source: &File
uk: &Файл

source: &Command
uk: &Команди

source: &Options
uk: &Параметри

source: &Below
uk: &Нижня

source: &Right
uk: &Права

source: Information
uk: ╤нформац╕я

source: Thank you for using GNU Midnight Commander
uk: Дяку╓мо вам за використання GNU Midnight Commander

source: The TERM environment variable is unset!
uk: Зм╕нну середовища TERM не встановлено!

source: -a, --stickchars Force use of +, -, | for line drawing.
uk: -a, --stickchars Використовувати символи +, -, | для малювання л╕н╕й.

source: -b, --nocolor Force black and white display.
uk: -b, --nocolor Примусове чорно-б╕ле в╕дображення.

source: -e, --edit Startup the internal editor.
uk: -e, --edit Запустити внутр╕шн╕й редактор.

source: -t, --termcap Activate support for the TERMCAP variable.
uk: -t, --termcap Активувати п╕дтримку зм╕нно╖ TERMCAP.

source: Library directory for the Midnight Commander: %s
uk: Каталог б╕бл╕отек Midnight Commander: %s

source: Option -m is obsolete. Please look at Display Bits... in the Option's menu
uk: Параметр -m застар╕в. Подив╕ться у В╕дображення б╕т╕в... в меню Параметри

source: Request to run in color mode
uk: Вимога на виконання в кольоровому режим╕

source: Specifies a color configuration
uk: Визнача╓ кольорову конф╕гурац╕ю

source: Edits one file
uk: Редагу╓ один файл

source: Displays this help message
uk: Показу╓ це дов╕дкове пов╕домлення

source: Log ftp dialog to specified file
uk: Журналювати д╕алог з ftp у вказаний файл

source: Obsolete
uk: Застар╕ле

source: Requests to run in black and white
uk: Вимога на виконання у чорноб╕лому режим╕

source: Disable mouse support in text version
uk: Вимкнення п╕дтримки миш╕ в текстов╕й верс╕╖

source: Disables subshell support
uk: Вимкнення п╕дтримки п╕д╕нтерпретатора команд

source: Prints working directory at program exit
uk: Друку╓ робочий каталог на виход╕ з програми

source: To run on slow terminals
uk: Для виконання на пов╕льних терм╕налах

source: Enables subshell support (default)
uk: Ув╕мкнення п╕дтримки п╕д╕нтерпретатора команд (типово)

source: Tries to use termcap instead of terminfo
uk: Спробувати використовувати termcap зам╕сть terminfo

source: Displays the current version
uk: Показу╓ поточну верс╕ю

source: Launches the file viewer on a file
uk: Запуска╓ переглядач на файл

source: Geometry for the window
uk: Геометр╕я в╕кна

source: GEOMETRY
uk: ГЕОМЕТР╤Я

source: No windows opened at startup
uk: Не в╕дкривати в╕кон на початку роботи

source: No desktop icons
uk: Нема╓ п╕ктограм робочого столу

source: Notice
uk: Зв╕стка

source: safe de&Lete
uk: Безпечне &видалення

source: cd follows lin&Ks
uk: Зм╕на &каталогу за посиланням

source: advanced cho&Wn
uk: Розширена команда cho&wn

source: l&Ynx-like motion
uk: Нав╕╜ац╕я в ст╕л╕ l&ynx

source: rotatin&G dash
uk: &Обертовий ╕ндикатор

source: co&Mplete: show all
uk: &Доповнення: показувати все

source: &Use internal view
uk: Вмонтований &перегляд

source: use internal ed&It
uk: Вмонтований &редактор

source: auto m&Enus
uk: Автоматичн╕ &меню

source: &Auto save setup
uk: &Автоматичне збер╕гання установок

source: &Fast dir reload
uk: &Швидке перевантаження каталог╕в

source: mi&X all files
uk: &Сум╕ш ус╕х файл╕в

source: &Drop down menus
uk: Випадаючи &меню

source: ma&Rk moves down
uk: Виб╕р пересува╓ться &вниз

source: show &Hidden files
uk: Показати &прихован╕ файли

source: show &Backup files
uk: Показати &резервн╕ коп╕╖

source: &Never
uk: &Н╕коли

source: on dumb &Terminals
uk: на &простих терм╕налах

source: alwa&Ys
uk: &Завжди

source: Configure options
uk: Параметри конф╕гурац╕╖

source: Panel options
uk: Параметри панел╕

source: Pause after run...
uk: Пауза п╕сля виконання

source: Configure options
uk: Параметри конф╕гурац╕╖

source: Command
uk: Команда

source: Other command
uk: ╤нша команда

source: Oops...
uk: Ой...

source: Cannot invoke command.
uk: Неможливо викликати команду.

source: Pipe close failed
uk: Не вдалось закрити канал

source: Show this help message
uk: Показати це дов╕дкове пов╕домлення

source: Display brief usage message
uk: Показати коротку дов╕дку про використання

source: SUB-DIR
uk: КАТАЛОГ

source: UP--DIR
uk: ВГОРУ

source: MTime
uk: ЧасМ

source: ATime
uk: ЧасД

source: CTime
uk: ЧасС

source: Perm
uk: Права

source: Inode
uk: I-вузол

source: Do you really want to execute?
uk: Ви справд╕ хочете виконати?

source: Cannot chdir to "%s" %s
uk: Неможливо зм╕нити каталог на "%s" %s

source: RenMov
uk: Перем

source: Mkdir
uk: СтвКат

source: Couldn't open named pipe %s
uk: Неможливо в╕дкрити ╕менований канал %s

source: The shell is still active. Quit anyway?
uk: ╤нтерпретатор залиша╓ться активним. Все-таки вийти?

source: There are stopped jobs.
uk: ╢ зупинен╕ завдання.

source: Quit anyway?
uk: Все-таки вийти?

source: Edition:
uk: Редакц╕я:

source: text mode
uk: текстовий режим

source: Virtual File System: tarfs, extfs
uk: В╕ртуальна Файлова Система: tarfs, extfs

source: (proxies: hsc proxy)
uk: (прокс╕: hsc-прокс╕)

source: (with termnet support)
uk: (з п╕дтримкою termnet)

source: With builtin Editor
uk: З владнаним редактором

source: With support for background operations
uk: З п╕дтримкою операц╕й на тл╕

source: Cannot open the %s file for writing: %s
uk: Неможливо в╕дкрити файл %s для записування: %s

source: Copy "%s" directory to:
uk: Скоп╕ювати каталог "%s" у:

source: Move "%s" directory to:
uk: Перенести каталог "%s" у:

source: Cannot stat the destination %s
uk: Неможливо отримати властивост╕ призначення %s

source: The destination isn't a directory
uk: М╕сцем призначення не ╓ каталог

source: Delete %s?
uk: Стерти %s?

source: Static
uk: Статичне

source: Dynamc
uk: Динам╕чне

source: Forget
uk: Забути

source: Cannot write to the %s file: %s
uk: Неможливо записати у файл %s: %s

source: Format error on file Extensions File
uk: Помилка формату у файл╕ розширень файл╕в

source: Invalid shell pattern definition "%c".
uk: Нев╕рне визначення шаблону оболонки "%c".

source: Debug
uk: Налагодження

source: ERROR:
uk: ПОМИЛКА:

source: True:
uk: ╤стина:

source: False:
uk: Хибн╕сть:

source: Warning -- ignoring file
uk: Попередження -- ╕гнорування файлу

source: File %s is not owned by root or you or is world writable. Using it may compromise your security
uk: Файл %s не належить root'у чи Вам або доступний на запис усiм. Використання цього файлу неприйнятно з мiркувань безпеки

source: I can't run programs while logged on a non local directory
uk: Неможливо виконувати програми, знаходячись не в локальному каталоз╕

source: No appropriative entries found in %s
uk: Не знайдено пасуючих запис╕в у %s

source: User menu
uk: Меню користувача

source: name_trunc: too big
uk: name_trunc: надто великий

source: Pipe failed
uk: Зб╕й каналу

source: Dup failed
uk: Зб╕й дублювання дескриптору

source: File:
uk: Файл:

source: has been modified, do you want to save the changes?
uk: було зм╕нено, хочете зберегти зм╕ни?

source: Save changes
uk: Зберегти зм╕ни

source: Cannot spawn child program
uk: Неможливо породити процес-нащадок

source: Empty output from child filter
uk: Пустий вив╕д з ф╕льтру

source: Could not open file
uk: Неможливо в╕дкрити файл

source: Cannot open file "
uk: Неможливо в╕дкрити файл "

source: Cannot stat file
uk: Неможливо отримати властивост╕ файлу

source: Cannot view: not a regular file
uk: Неможливо показати: не звичайний файл

source: Cannot open "%s" %s
uk: Неможливо в╕дкрити "%s" %s

source: Cannot stat "%s" %s
uk: Неможливо отримати властивост╕ "%s" %s

source: File: %s
uk: Файл: %s

source: Offset 0x%08x
uk: Зм╕щення 0x%08x

source: [grow]
uk: [р╕ст]

source: Searching for `%s'
uk: Пошук "%s"

source: Search string not found
uk: Рядок незнайдено

source: Invalid regular expression
uk: Нев╕рний ре╜улярний вираз

source: The current line number is %d. Enter the new line number:
uk: Поточний номер рядка - %d. Введ╕ть новий номер рядка:

source: The current address is 0x%lx. Enter the new address:
uk: Поточне зм╕щення - 0x%lx. Введ╕ть нове зм╕щення:

source: Goto Address
uk: Перех╕д за адресою

source: Enter regexp:
uk: Введ╕ть ре╜улярний вираз:

source: Goto
uk: Перейти

source: Line
uk: Рядок

source: History
uk: ╤стор╕я

source: Function key 1
uk: F1

source: Function key 2
uk: F2

source: Function key 3
uk: F3

source: Function key 4
uk: F4

source: Function key 5
uk: F5

source: Function key 6
uk: F6

source: Function key 7
uk: F7

source: Function key 8
uk: F8

source: Function key 9
uk: F9

source: Function key 10
uk: F10

source: Function key 11
uk: F11

source: Function key 12
uk: F12

source: Function key 13
uk: F13

source: Function key 14
uk: F14

source: Function key 15
uk: F15

source: Function key 16
uk: F16

source: Function key 17
uk: F17

source: Function key 18
uk: F18

source: Function key 19
uk: F19

source: Function key 20
uk: F20

source: Backspace key
uk: Backspace

source: End key
uk: End

source: Up arrow key
uk: Стр╕лка вгору

source: Down arrow key
uk: Стр╕лка вниз

source: Left arrow key
uk: Стр╕лка вл╕во

source: Right arrow key
uk: Стр╕лка вправо

source: Home key
uk: Home

source: Page Down key
uk: Page Down

source: Page Up key
uk: Page Up

source: Insert key
uk: Insert

source: Delete key
uk: Delete

source: + on keypad
uk: Додаткова +

source: - on keypad
uk: Додаткова -

source: * on keypad
uk: Додаткова *

source: Left arrow keypad
uk: Додаткова Стр╕лка вл╕во

source: Right arrow keypad
uk: Додаткова Стр╕лка вправо

source: Up arrow keypad
uk: Додаткова Стр╕лка вверх

source: Down arrow keypad
uk: Додаткова Стр╕лка вниз

source: Home on keypad
uk: Додаткова Home

source: End on keypad
uk: Додаткова End

source: Page Down keypad
uk: Додаткова Page Down

source: Page Up keypad
uk: Додаткова Page Up

source: Insert on keypad
uk: Додаткова Insert

source: Delete on keypad
uk: Додаткова Delete

source: Enter on keypad
uk: Додаткова Enter

source: Slash on keypad
uk: Додаткова /

source: NumLock on keypad
uk: NumLock

source: Couldn't open cpio archive %s
uk: Неможливо в╕дкрити cpio-арх╕в %s

source: Unexpected end of file %s
uk: Неоч╕куваний к╕нець файлу %s

source: Starting linear transfer...
uk: Початок л╕н╕йного перенесення...

source: Getting file
uk: Отримання файлу

source: Couldn't open %s archive %s
uk: Неможливо в╕дкрити арх╕в %s %s

source: fish: Disconnecting from %s
uk: fish: Розрив з'╓днання з %s

source: fish: Waiting for initial line...
uk: fish: Оч╕кування початкового рядка...

source: Sorry, we can not do password authenticated connections for now.
uk: Вибачте, неможливо створити авторизован╕ паролем з'╓днання зараз.

source: fish: Password required for
uk: fish: Необх╕дний пароль для

source: fish: Sending password...
uk: fish: В╕дсилання паролю...

source: fish: Sending initial line...
uk: fish: В╕дсилання початкового рядка...

source: fish: Handshaking version...
uk: fish: Верс╕я п╕дтримання зв'язку...

source: fish: Setting up current directory...
uk: fish: Встановлення поточного каталогу...

source: fish: Connected, home %s.
uk: fish: З'╓днано, персональний каталог %s.

source: fish: Reading directory %s...
uk: fish: Зчитування каталогу %s...

source: fish: failed
uk: fish: помилка

source: fish: store %s: sending command...
uk: fish: запис %s: в╕дсила╓ться команда...

source: fish: storing %s %d (%d)
uk: fish: збереження %s %d (%d)

source: zeros
uk: нул╕

source: Aborting transfer...
uk: Перепин перенесення...

source: Error reported after abort.
uk: Пов╕домлено про помилку п╕сля перепину.

source: Aborted transfer would be successful.
uk: Перенесення усп╕шно перепинено.

source: ftpfs: Disconnecting from %s
uk: ftpfs: В╕д'╓днання в╕д %s

source: FTP: Password required for
uk: FTP: Необх╕дний пароль для

source: Proxy: Password required for
uk: Прокс╕: Необх╕дний пароль для

source: ftpfs: sending proxy login name
uk: ftpfs: в╕дсилання назви користувача прокс╕

source: ftpfs: sending proxy user password
uk: ftpfs: в╕дсилання паролю користувача прокс╕

source: ftpfs: proxy authentication succeeded
uk: ftpfs: авторизац╕я на прокс╕ пройшла усп╕шно

source: ftpfs: connected to %s
uk: ftpfs: з'╓днано з %s

source: ftpfs: sending user password
uk: ftpfs: в╕дсилання паролю користувача

source: ftpfs: logged in
uk: ftpfs: заре╓стровано

source: ftpfs: Login incorrect for user %s
uk: ftpfs: Помилка ре╓страц╕╖ для користувача %s

source: ftpfs: Invalid host name.
uk: ftpfs: Нев╕рна назва хоста.

source: ftpfs: Invalid host address.
uk: ftpfs: Нев╕рна адреса хоста.

source: ftpfs: making connection to %s
uk: ftpfs: створення з'╓днання з %s

source: ftpfs: connection interrupted by user
uk: ftpfs: з'╓днання перервано користувачем

source: ftpfs: connection to server failed: %s
uk: ftpfs: невдала спроба з'╓днання до сервера: %s

source: Waiting to retry... %d (Control-C to cancel)
uk: Оч╕кування в╕дпов╕д╕... %d (Control-C - в╕дмова)

source: ftpfs: could not setup passive mode
uk: ftpfs: не вдалося встановити пасивний режим

source: ftpfs: aborting transfer.
uk: ftpfs: переривання перенесення.

source: ftpfs: abort error: %s
uk: ftpfs: помилка переривання: %s

source: ftpfs: abort failed
uk: ftpfs: не вдалося перервати

source: ftpfs: CWD failed.
uk: ftpfs: не вдалося зм╕нити каталог.

source: ftpfs: couldn't resolve symlink
uk: ftpfs: неможливо роз╕менувати символьне посилання

source: Resolving symlink...
uk: Роз╕менування символьного посилання...

source: ftpfs: Reading FTP directory %s... %s%s
uk: ftpfs: Зчитування FTP-каталогу %s... %s%s

source: (strict rfc959)
uk: (обмеження rfc959)

source: (chdir first)
uk: (сперш chdir)

source: ftpfs: failed
uk: ftpfs: помилка

source: ftpfs: failed; nowhere to fallback to
uk: ftpfs: помилка; нема╓ куди перейти в авар╕йний режим

source: ftpfs: storing file %d (%d)
uk: ftpfs: збереження файлу %d (%d)

source: ~/.netrc file has not correct mode. Remove password or correct mode.
uk: Файл ~/.netrc ма╓ нев╕рний режим доступу/волод╕ння. Видал╕ть пароль чи виправте режим доступу/волод╕ння.

source: The server does not support this version
uk: Сервер не п╕дтриму╓ цю верс╕ю

source: Yes
uk: Так

source: No
uk: Н╕

source: The remote server is running on strange port. Giving up.
uk: В╕ддалений сервер запущено на дивному порту. В╕дмова.

source: MCFS Password required
uk: Необх╕дний пароль MCFS

source: Invalid password
uk: Нев╕рний пароль

source: Cannot locate hostname: %s
uk: Неможливо знайти назву машини: %s

source: Cannot create socket: %s
uk: Неможливо створити сокет: %s

source: Cannot connect to server: %s
uk: Неможливо з'╓днатися з сервером: %s

source: Too many open connections
uk: Надто багато в╕дкритих з'╓днань

source: reconnect to %s failed
uk: повторне з'╓днання з %s не вдалось

source: Authentication failed
uk: Зб╕й авторизац╕╖

source: %s mkdir'ing %s
uk: %s створення каталогу %s

source: %s rmdir'ing %s
uk: %s видалення каталогу %s

source: %s opening remote file %s
uk: %s в╕дкриття в╕ддаленого файлу %s

source: %s renaming files
uk: %s перейменування файл╕в

source: Couldn't open tar archive %s
uk: Невдалося в╕дкрити tar-арх╕в %s

source: Unexpected EOF on archive file
uk: Неоч╕куване завершення арх╕вного файлу

source: Inconsistent tar archive
uk: Неузгоджений tar-арх╕в

source: Hmm,... %s doesn't look like a tar archive.
uk: Гмм,... %s не схоже на tar-арх╕в.

source: undelfs: error
uk: undelfs: помилка

source: not enough memory
uk: недостатньо пам'ят╕

source: while allocating block buffer
uk: на отриман╕ блока буфер╕в

source: while starting inode scan %d
uk: на початку сканування i-вузла %d

source: undelfs: loading deleted files information %d inodes
uk: undelfs: завантаження ╕нформац╕╖ про видален╕ файли %d i-вузл╕в

source: while calling ext2_block_iterate %d
uk: на виклику ext2_block_iterate %d

source: no more memory while reallocating array
uk: невистачило пам'ят╕ при перев╕дкритт╕ масиву

source: while doing inode scan %d
uk: на скануванн╕ i-вузла %d

source: Ext2lib error
uk: Помилка ext2lib

source: Could not open file %s
uk: Не вдалось в╕дкрити файл %s

source: undelfs: reading inode bitmap...
uk: undelfs: зчитування б╕тово╖ мапи i-вузл╕в...

source: Could not load inode bitmap from: %s
uk: Не вдалось завантажити б╕тову мапу i-вузл╕в з: %s

source: undelfs: reading block bitmap...
uk: undelfs: зчитування блока б╕тово╖ мапи...

source: Could not load block bitmap from: %s
uk: Не вдалось завантажити блок б╕тово╖ мапи з: %s

source: undelfs: done.
uk: undelfs: завершено.

source: undelfs: failure
uk: undelfs: зб╕й

source: vfs_info is not fs!
uk: vfs_info не файлова система!

source: You have to chdir to extract files first
uk: Спочатку потр╕бно зм╕нити каталог щоб витягти файли

source: while iterating over blocks
uk: на проходжен╕ блок╕в

source: Could not open file: %s
uk: Не вдалось в╕дкрити файл: %s

source: Changes to file lost
uk: Зм╕ни до файлу втрачено

source: Could not parse:
uk: Не вдалось проанал╕зувати:

source: More parsing errors will be ignored.
uk: ╤нш╕ помилки анал╕зу буде про╕гноровано.

source: (sorry)
uk: (вибачте)

source: Internal error:
uk: Внутр╕шня помилка:

source: %s: %s: %s %3d%% (%ld bytes transfered)
uk: %s: %s: %s %3d%% (%ld байт перенесено)

source: %s: %s: %s %ld bytes transfered
uk: %s: %s: %s %ld байт перенесено
