Repository: MidnightCommander/mc
Catalog: po/*.po
Languages: uk

source: Warning: Searching backward can be slow
uk: Увага: Пошук назад може бути пов╕льним

source: Prompt on replace
uk: П╕дтвердження на зам╕ну

source: Ask before making each replacement
uk: Перепитувати перед зам╕ною

source: Replace all
uk: Зам╕нити все

source: Bookmarks
uk: Закладки

source: Create bookmarks at all lines found
uk: Створити закладки на вс╕х знайдених рядках

source: Scanf expression
uk: Вираз scanf

source: Begin search, Enter
uk: Розпочати пошук, Enter

source: Abort this dialog, Esc
uk: В╕дм╕нити д╕ю, Esc

source: Replace
uk: Зам╕нити

source: Skip
uk: Пропустити

source: Replace all
uk: Зам╕нити все

source: Replace one
uk: Зам╕нити раз

source: %ld replacements made.
uk: %ld зам╕н зроблено.

source: Search string not found.
uk: Рядок не знайдено.

source: Quit
uk: Вих╕д

source: Current text was modified without a file save. Save with exit?
uk: Поточний текст було зм╕нено ╕ не збережено. Зберегти перед виходом?

source: File was modified, Save with exit?
uk: Файл було зм╕нено, зберегти перед виходом?

source: Cancel quit
uk: Не виходити

source: &Yes
uk: Так

source: &No
uk: Н╕

source: &Cancel quit
uk: Не виходити

source: &Yes
uk: Так

source: &No
uk: Н╕

source: Copy to clipboard
uk: Коп╕ювання у буфер обм╕ну

source: Unable to save to file.
uk: Неможливо зберегти у файл.

source: Cut to clipboard
uk: Вир╕зання у буфер обм╕ну

source: Goto line
uk: Перех╕д на рядок

source: Enter line:
uk: Введ╕ть номер рядка:

source: Save Block
uk: Збереження блоку

source: Insert File
uk: Вставляння файлу

source: Insert file
uk: Вставити файл

source: Error trying to insert file.
uk: Помилка на спроб╕ вставити файл.

source: Sort block
uk: Сортування блоку

source: You must first highlight a block of text.
uk: Необх╕дно спочатку вид╕лити блок тексту.

source: Run Sort
uk: Почати сортування

source: Enter sort options (see manpage) separated by whitespace:
uk: Введ╕ть параметри sort розд╕лен╕ пропусками:

source: Sort
uk: Сортування

source: Error trying to execute sort command
uk: Помилка на спроб╕ виконати команду sort

source: Error create script:
uk: Помилка створення скрипту:

source: Error read script:
uk: Помилка зчитування скрипту:

source: Error close script:
uk: Помилка закривання скрипту:

source: Script created:
uk: Скрипт створено:

source: Process block
uk: Обробити блок

source: Mail
uk: В╕дсилання

source: Copies to
uk: Коп╕╖ до

source: Subject
uk: Заголовок

source: To
uk: До

source: mail -s <subject> -c <cc> <to>
uk: mail -s <заголовок> -c <коп╕╖> <до>

source: Word wrap
uk: Форматування рядка

source: Enter line length, 0 for off:
uk: Введ╕ть довжину рядка, 0 - вимкнути:

source: About
uk: Про

source: Cooledit v3.11.5 Copyright (C) 1996 the Free Software Foundation A user friendly text editor written for the Midnight Commander.
uk: Cooledit v3.11.5 Copyright © 1996 the Free Software Foundation Текстовий редактор з дружн╕м ╕нтерфейсом користувача. Створено для Midnight Commander.

source: &New C-n
uk: &Новий C-n

source: &Save F2
uk: З&берети F2

source: save &As... F12
uk: Зберегти &як... F12

source: &Insert file... F15
uk: &Вставити файл... F15

source: copy to &File... C-f
uk: Скоп╕ювати у файл... C-f

source: &User menu... F11
uk: Меню &користувача... F11

source: a&Bout...
uk: &Про...

source: &Quit F10
uk: &Вийти F10

source: &New C-x k
uk: Новий C-x k

source: copy to &File...
uk: Скоп╕ювати у файл...

source: &Toggle Mark F3
uk: &Перемикнути в╕дм╕тку F3

source: &Mark Columns S-F3
uk: В╕дм╕чати &стовпчики S-F3

source: &Copy F5
uk: &Скоп╕ювати F5

source: &Move F6
uk: Пере&нести F6

source: &Delete F8
uk: &Стерти F8

source: &Undo C-u
uk: В╕д&кат C-u

source: &Beginning C-PgUp
uk: На &початок C-PgUp

source: &End C-PgDn
uk: На &к╕нець C-PgDn

source: &Search... F7
uk: &Шукати... F7

source: search &Again F17
uk: Шукати &знову F17

source: &Replace... F4
uk: &Зам╕нити... F4

source: &Goto line... M-l
uk: &Перейти на рядок M-l

source: goto matching &Bracket M-b
uk: Перейти до в╕дпов╕дно╖ дужки M-b

source: insert &Literal... C-q
uk: Вставити &л╕терал... C-q

source: &Refresh screen C-l
uk: &Поновити екран C-l

source: &Start record macro C-r
uk: &Розпочати запис макросу C-r

source: &Finish record macro... C-r
uk: &Завершити запис макросу... C-r

source: &Execute macro... C-a, KEY
uk: &Виконати макрос... C-a, Kлав╕ша

source: delete macr&O...
uk: Ви&далити макрос...

source: insert &Date/time
uk: Вставити &дату/час

source: format p&Aragraph M-p
uk: В╕дформатувати &параграф M-p

source: 'ispell' s&Pell check C-p
uk: Перев╕рка орфограф╕╖ "ispell" C-p

source: sor&T... M-t
uk: &Сортувати M-t

source: E&xternal Formatter F19
uk: Зовн╕шн╕й Форматувальник F19

source: &Mail...
uk: &В╕д╕слати...

source: &Execute macro... C-x e, KEY
uk: Виконати макрос... C-x e, КЛАВ╤ША

source: 'ispell' s&Pell check M-$
uk: Перев╕рка орфограф╕╖ "ispell" C-p

source: &General...
uk: &Загальн╕...

source: &Save mode...
uk: &Режим збереження...

source: &Layout...
uk: &Схема розташування...

source: File
uk: Файл

source: Edit
uk: Редагування

source: Sear/Repl
uk: Пошук/Зам╕на

source: Command
uk: Команда

source: Options
uk: Параметри

source: Open... C-o
uk: В╕дкрити... C-o

source: New C-n
uk: Новий C-n

source: Save F2
uk: Зберегти F2

source: Save as... F12
uk: Зберегти як... F12

source: Insert file... F15
uk: Вставити файл... F15

source: Copy to file... C-f
uk: Скоп╕ювати у файл... C-f

source: Copy block to cursor F5
uk: Скоп╕ювати блок F5

source: Move block to cursor F6
uk: Перенести блок F6

source: Delete block F8/C-Del
uk: Стерти блок F8/C-Del

source: Copy block to clipbrd C-Ins
uk: Скоп╕ювати блок у буфер обм╕ну C-Ins

source: Cut block to clipbrd S-Del
uk: Вир╕зати блок у буфер обм╕ну S-Del

source: Paste block from clipbrd S-Ins
uk: Вставити блок з буферу обм╕ну S-Ins

source: Srch/Replce
uk: Пошук/Зам╕на

source: Search... F7
uk: Шукати... F7

source: Search again F17
uk: Шукати знову F17

source: Replace... F4
uk: Зам╕нити... F4

source: Replace again F14
uk: Зам╕нити знову F14

source: Search for and replace text
uk: Знайти та зам╕нити текст

source: Goto line... M-l
uk: Перейти на рядок... M-l

source: Goto matching bracket M-b
uk: Перейти на в╕дпов╕дну дужку M-b

source: Start record macro C-r
uk: Розпочати запис макросу C-r

source: Finish record macro... C-r
uk: Завершити запис макросу... C-r

source: Execute macro... C-a, KEY
uk: Виконати макрос... C-a, Клав╕ша

source: Delete macro...
uk: Видалити макрос..

source: Insert date/time C-d
uk: Вставити дату/час C-d

source: Format paragraph M-p
uk: Форматувати параграф M-p

source: Refresh display C-l
uk: Оновити зображення C-l

source: Macros and internal commands
uk: Макроси та внутр╕шн╕ команди

source: Intuitive
uk: ╤нту╕тивна

source: None
uk: Нема╓

source: Dynamic paragraphing
uk: Динам╕чн╕ абзаци

source: Word wrap line length :
uk: Позиц╕я обриву рядк╕в:

source: Tab spacing :
uk: Крок табуляц╕╖ :

source: synta&X highlighting
uk: &Вид╕лення синтаксису кольором

source: confir&M before saving
uk: П╕дтвердження на запис

source: fill tabs with &Spaces
uk: &Заповнення табуляц╕╖ пропусками

source: &Return does autoindent
uk: &Автовир╕внювання рядк╕в

source: &Fake half tabs
uk: &Симуляц╕я п╕втабуляц╕╖

source: Key emulation
uk: Емуляц╕я клав╕ш

source: Editor options
uk: Параметри редактора

source: Error initialising editor.
uk: Помилка ╕н╕ц╕ал╕зац╕╖ редактора.

source: Help
uk: Дов╕дка

source: Mark
uk: Виб╕р

source: Replac
uk: Зам╕на

source: PullDn
uk: МенюMC

source: Quit
uk: Вих╕д

source: Enter file name:
uk: Введ╕ть назву файлу:

source: Interactive help browser
uk: ╤нтерактивна дов╕дкова система

source: Save to current file name
uk: Зберегти з поточною назвою файлу

source: Find and replace strings/regular expressions
uk: Знайти та зам╕нити рядок чи ре╜улярний вираз

source: Copy highlighted block to cursor position
uk: Скоп╕ювати вид╕лений блок в позиц╕ю курсора

source: Move highlighted block to cursor position
uk: Перенести вид╕лений блок в позиц╕ю курсора

source: Find
uk: Знайти

source: Find strings/regular expressions
uk: Знайти рядок чи ре╜улярний вираз

source: Delete highlighted text
uk: Стерти вид╕лений текст

source: Menu
uk: Меню

source: Exit editor
uk: Вийти з редактора

source: Clear the edit buffer
uk: Очистити буфер редагування

source: Insert File
uk: Вставити файл

source: Insert text from a file
uk: Вставити текст з файлу

source: Copy to file
uk: Скоп╕ювати у файл

source: copy a block to a file
uk: Скоп╕ювати блок у файл

source: Search/Replace
uk: Пошук/Зам╕на

source: Load syntax file
uk: Завантажити файл синтаксису

source: File access error
uk: Помилка доступу до файлу

source: Error in file %s on line %d
uk: Помилка у файл╕ %s в рядку %d

source: &Set
uk: Встановити

source: S&kip
uk: Пропустити

source: Set &all
uk: Встановити вс╕

source: owner
uk: власник

source: group
uk: група

source: other
uk: ╕нш╕

source: %6d of %d
uk: %6d з %d

source: Couldn't chmod "%s" %s
uk: Не вдалося зм╕нити режим доступу "%s" %s

source: Couldn't chown "%s" %s
uk: Не вдалося зм╕нити власника "%s" %s

source: Background process:
uk: Процес на тл╕:

source: Background process error
uk: Помилка процесу на тл╕

source: Child died unexpectedly
uk: Зб╕й спадко╓много процесу

source: Unknown error in child
uk: Нев╕дома помилка в нащадку

source: Listing mode
uk: Параметри списку

source: &Full file list
uk: &Повний список файл╕в

source: &Brief file list
uk: &Короткий список файл╕в

source: &Long file list
uk: &Довгий список файл╕в

source: &User defined:
uk: &Визначений користувачем

source: user &Mini status
uk: Користувацький рядок &статусу

source: Listing mode
uk: Параметри списку

source: &Reverse
uk: &Перевернутий

source: case sensi&tive
uk: &Врахувати рег╕стр

source: Sort order
uk: Порядок сортування

source: confirm &Exit
uk: П╕дтвердження ви&ходу

source: confirm e&Xecute
uk: П╕дтвердження &виконання

source: confirm o&Verwrite
uk: П╕дтвердження &зам╕щення

source: confirm &Delete
uk: П╕дтвердження ви&далення

source: Confirmation
uk: П╕дтвердження

source: Full 8 bits output
uk: Повний 8-б╕тний вив╕д

source: 7 bits
uk: 7 б╕т╕в

source: F&ull 8 bits input
uk: Повний 8-б╕тний вв╕д

source: Display bits
uk: В╕дображення б╕т╕в

source: &Always use ftp proxy
uk: &Завжди використовувати прокс╕ FTP

source: sec
uk: с

source: Virtual File System Setting
uk: Установки В╕ртуально╖ Файлово╖ Системи

source: Quick cd
uk: Швидка зм╕на каталогу

source: cd
uk: зм╕на каталогу

source: Symbolic link
uk: Символьне посилання

source: Running
uk: Виконання

source: &Stop
uk: Зу&пинити

source: &Resume
uk: &Продовжити

source: &Kill
uk: &Знищити

source: Background Jobs
uk: Завдання на тл╕

source: Owner name
uk: Назва власника

source: Group name
uk: Назва групи

source: Chmod command
uk: Зм╕на прав

source: Permission
uk: Права

source: Use SPACE to change
uk: Використовуйте ПРОПУСК для

source: an option, ARROW KEYS
uk: зм╕ни параметру, СТР╤ЛКИ

source: to move between options
uk: для пересування та T

source: and T or INS to mark
uk: чи INS для вибору

source: Owner name
uk: Назва власника

source: Group name
uk: Назва групи

source: Size
uk: Розм╕р

source: User name
uk: Назва користувача

source: <Unknown user>
uk: <Нев╕домий користувач>

source: <Unknown group>
uk: <Нев╕дома група>

source: Files tagged, want to cd?
uk: Вибрано файли, хочете зм╕нити каталог?

source: Could not change directory
uk: Неможливо зм╕нити каталог

source: View file
uk: Перегляд файлу

source: Filename:
uk: Назва файлу:

source: Filtered view
uk: Ф╕льтрований перегляд

source: Filter command and arguments:
uk: Команда-ф╕льтр та аргументи:

source: Create a new Directory
uk: Створення нового каталогу

source: Enter directory name:
uk: Введ╕ть назву каталогу:

source: Filter
uk: Ф╕льтр

source: Set expression for filtering filenames
uk: Вкаж╕ть вираз для ф╕льтрац╕╖ назв файл╕в

source: Menu edit
uk: Редагування меню

source: Which menu file will you edit ?
uk: Який файл меню ви хочете редагувати?

source: &Local
uk: Локальний

source: &Home
uk: Домашн╕й

source: Compare directories
uk: Пор╕вняння каталог╕в

source: Select compare method:
uk: Вибер╕ть метод пор╕вняння:

source: &Quick
uk: Швидкий

source: &Size only
uk: Лише розм╕р

source: &Thorough
uk: Докладний

source: The command history is empty
uk: ╤стор╕я команд порожня

source: Command history
uk: ╤стор╕я команд

source: Type `exit' to return to the Midnight Commander
uk: Введ╕ть "exit" для повернення в Midnight Commander

source: Link
uk: Посилання

source: to:
uk: в:

source: link: %s
uk: посилання: %s

source: symlink: %s
uk: символьне посилання: %s

source: Symlink `%s' points to:
uk: Символьне посилання "%s" вказу╓ на:

source: Edit symlink
uk: Редагування символьного посилання

source: Enter machine name (F1 for details):
uk: Введ╕ть назву машини (F1 - подробиц╕):

source: Could not chdir to %s
uk: Неможливо перейти в каталог %s

source: Link to a remote machine
uk: Зв'язок ╕з в╕ддаленою машиною

source: FTP to machine
uk: FTP-зв'язок ╕з машиною

source: SMB link to machine
uk: SMB-зв'язок ╕з машиною

source: Host name
uk: Назва хоста

source: Error while looking up IP address
uk: Помилка пошуку IP-адреси

source: Undelete files on an ext2 file system
uk: В╕дновлення файл╕в на файлов╕й систем╕ ext2

source: Setup saved to ~/
uk: Установки збережено в ~/

source: Setup
uk: Установки

source: Cannot chdir to '%s' %s
uk: Неможливо перейти в каталог "%s" %s

source: &Unsorted
uk: &Не сортувати

source: &Name
uk: За &назвою

source: &Extension
uk: За роз&ширенням

source: &Modify time
uk: За часом &модиф╕кац╕╖

source: &Access time
uk: За часом &доступу

source: &Change time
uk: За часом &зм╕ни

source: &Size
uk: За &розм╕ром

source: &Inode
uk: За i-&вузлом

source: &Type
uk: За &типом

source: &Owner
uk: За &власником

source: &Group
uk: За &групою

source: Cannot create temporary command file %s
uk: Неможливо створити тимчасовий командний файл %s

source: Parameter
uk: Параметр

source: Copy
uk: Коп╕ювання

source: Move
uk: Перенесення

source: Delete
uk: Видалення

source: Could not make the hardlink
uk: Не вдалося створити жорстке посилання

source: Cannot create special file "%s" %s
uk: Неможливо створити спец╕альний файл "%s" %s

source: Cannot chown target file "%s" %s
uk: Неможливо зм╕нити власника ц╕льового файлу "%s" %s

source: Cannot chmod target file "%s" %s
uk: Неможливо зм╕нити права доступу до ц╕льового файлу "%s" %s

source: Cannot create target file "%s" %s
uk: Неможливо створити ц╕льовий файл "%s" %s

source: Cannot write target file "%s" %s
uk: Неможливо записати файл призначення "%s" %s

source: Cannot close target file "%s" %s
uk: Неможливо закрити файл призначення "%s" %s

source: Incomplete file was retrieved. Keep it?
uk: Отримано неповний файл. Залишити його?

source: &Delete
uk: &Стерти

source: &Keep
uk: &Лишити

source: Cannot copy cyclic symbolic link `%s'
uk: Неможливо скоп╕ювати цикл╕чне символьне посилання `%s'

source: Cannot create target directory "%s" %s
uk: Неможливо створити ц╕льовий каталог "%s" %s

source: Cannot stat file "%s" %s
uk: Неможливо отримати властивост╕ файлу "%s" %s

source: Cannot overwrite directory `%s'
uk: Неможливо переписати каталог "%s"

source: Cannot move file "%s" to "%s" %s
uk: Неможливо перенести файл "%s" у "%s" %s

source: Cannot remove file "%s" %s
uk: Не вдалося видалити файл "%s" %s

source: Cannot overwrite directory "%s" %s
uk: Не вдалося переписати каталог "%s" %s

source: Cannot overwrite file "%s" %s
uk: Не вдалося переписати файл "%s" %s

source: Cannot move directory "%s" to "%s" %s
uk: Не вдалося перенести каталог "%s" у "%s" %s

source: Cannot delete file "%s" %s
uk: Неможливо стерти файл "%s" %s

source: Cannot remove directory "%s" %s
uk: Неможливо видалити каталог "%s" %s

source: 1Copy
uk: 1Скоп╕ювати

source: 1Move
uk: 1Перенести

source: 1Delete
uk: 1Стерти

source: %o %d %f%m
uk: %o ц╕ %f (%d шт) %m

source: %o %d %f%e
uk: %o ц╕ %f (%d шт) %e

source: file
uk: файл

source: files
uk: файли

source: directory
uk: каталог

source: directories
uk: каталоги

source: files/directories
uk: файли/каталоги

source: with source mask:
uk: з вих╕дною маскою:

source: Yes
uk: Так

source: No
uk: Н╕

source: Internal failure
uk: Внутр╕шн╕й зб╕й

source: Unknown file operation
uk: Нев╕дома файлова операц╕я

source: Destination "%s" must be a directory %s
uk: М╕сце призначення "%s" мусить бути каталогом %s

source: &Retry
uk: &Повторити

source: &Abort
uk: &Перервати

source: Directory not empty. Delete it recursively?
uk: Каталог не порожн╕й. Стерти його рекурсивно?

source: Background process: Directory not empty Delete it recursively?
uk: Процес на тл╕: Каталог не порожн╕й Стерти його рекурсивно?

source: a&ll
uk: &вс╕

source: all the directories
uk: вс╕ каталоги

source: Recursive Delete
uk: Рекурсивне стирання

source: Background process: Recursive Delete
uk: Процес на тл╕: рекурсивне стирання

source: File
uk: Файл

source: Count
uk: К╕льк╕сть

source: Bytes
uk: Байти

source: Source
uk: Джерело

source: Target
uk: Ц╕ль

source: Deleting
uk: Видалення

source: Target file "%s" already exists!
uk: Ц╕льовий файл "%s" вже ╕сну╓!

source: &Update
uk: Поновити

source: ap&Pend
uk: Додати

source: File exists
uk: Файл ╕сну╓

source: Background process: File exists
uk: Процес на тл╕: Файл ╕сну╓

source: preserve &Attributes
uk: Збер╕гати атрибути

source: &Background
uk: На &тл╕

source: &Suspend
uk: При&зупинити

source: Con&tinue
uk: &Продовжити

source: &Again
uk: &Знову

source: &Quit
uk: &Вийти

source: Pane&lize
uk: Пане&л╕зувати

source: &View - F3
uk: &Переглянути - F3

source: &Edit - F4
uk: &Редагувати - F4

source: &Tree
uk: &Дерево

source: Help file format error 
uk: Помилка формату файлу дов╕дки 

source: Help
uk: Дов╕дка

source: Cannot open file %s %s
uk: Неможливо в╕дкрити файл %s %s

source: Index
uk: Покажчик

source: &Move
uk: Пере&сунути

source: &Remove
uk: Ви&далити

source: &Append
uk: &Додати

source: &Insert
uk: &Вставити

source: New &Entry
uk: Новий &елемент

source: New &Group
uk: Нова &група

source: &Up
uk: Вгор&у

source: &Add current
uk: &Додати поточний

source: Change &To
uk: &Перейти в

source: Subgroup - press ENTER to see list
uk: П╕дгрупа - натисн╕ть ENTER щоб побачити список

source: Active VFS directories
uk: Активн╕ каталоги ВФС

source: Directory hotlist
uk: П╕дручн╕ каталоги

source: Directory path
uk: Каталог

source: Directory label
uk: М╕тка каталогу

source: New hotlist entry
uk: Новий елемент

source: Directory label
uk: Позначка каталогу

source: Directory path
uk: Каталог

source: New hotlist group
uk: Створення ново╖ групи

source: Name of new group
uk: Назва ново╖ групи

source: Label for "%s":
uk: Позначка до "%s":

source: Add to hotlist
uk: Додати до списку

source: Remove:
uk: Видалити:

source: Group not empty. Remove it?
uk: Група не порожня. Видалити ╖╖?

source: Top level group
uk: Група верхнього р╕вня

source: Hotlist is now kept in file ~/
uk: Список збережено у файл╕ ~/

source: MC will load hotlist from ~/
uk: Завантажено список з ~/

source: Hotlist Load
uk: Завантаження списку

source: MC was unable to write ~/
uk: Неможливо записати ~/

source: File: %s
uk: Файл: %s

source: Free nodes %d (%d%%) of %d
uk: В╕льно %d (%d%%) вузл╕в з %d

source: Free space
uk: В╕льно

source: (%d%%) of
uk: (%d%%) з

source: Type: %s
uk: Тип: %s

source: non-local vfs
uk: не локальна ВФС

source: Device: %s
uk: Пристр╕й: %s

source: Filesystem: %s
uk: Файлсистема: %s

source: Accessed: %s
uk: Доступ: %s

source: Modified: %s
uk: Модиф╕ковано: %s

source: Created: %s
uk: Створено: %s

source: Size:
uk: Розм╕р:

source: (%d blocks)
uk: (%d блок╕в)

source: Owner: %s/%s
uk: Власник: %s/%s

source: Links: %d
uk: Посилань: %d

source: Mode: %s (%04o)
uk: Права: %s (%04o)

source: Location: %Xh:%Xh
uk: Розм╕щення: %Xh:%Xh

source: File: None
uk: Файл: Нема╓

source: &Vertical
uk: &Вертикальне

source: &Horizontal
uk: &Горизонтальне

source: &Xterm hintbar
uk: Панель порад &Xterm

source: h&Intbar visible
uk: Панель &порад

source: &Keybar visible
uk: Панель &клав╕ш

source: command &Prompt
uk: Рядок &вводу команд

source: show &Mini status
uk: Рядок &стану

source: menu&Bar visible
uk: Панель &меню

source: &Equal split
uk: &Р╕вне розд╕лення

source: pe&Rmissions
uk: &Права доступу

source: &File types
uk: &Типи файл╕в

source: &Save
uk: &Зберегти

source: Layout
uk: Схема розташування

source: Panel split
uk: Розд╕лення панелей

source: Highlight...
uk: П╕дсв╕тка

source: Other options
uk: ╤нш╕ параметри

source: output lines
uk: рядк╕в виводу

source: Layout
uk: Схема розташування

source: Learn keys
uk: Розп╕знавання клав╕ш

source: Teach me a key
uk: Розп╕знавання клав╕ш╕

source: Please press the %s and then wait until this message disappears. Then, press it again to see if OK appears next to its button. If you want to escape, press a single Escape key and wait as well.
uk: Будь ласка натисн╕ть клав╕шу %s ╕ почекайте, доки це пов╕домлення не зникне. Пот╕м натисн╕ть ╖╖ ще раз, щоб пересв╕дчитись, що справа в╕д ╖╖ назви з'явилась позначка √. Якщо ви хочете припинити розп╕знавання, натисн╕ть клав╕шу Esc ╕ теж тр╕шки зачекайте.

source: Cannot accept this key
uk: Неможливо прийняти цю клав╕шу

source: You have entered "%s"
uk: Ви ввели "%s"

source: It seems that all your keys already work fine. That's great.
uk: Схоже, що ус╕ ваш╕ клав╕ш╕ тепер працюють нормально. Це чудово.

source: &Discard
uk: В╕дмова

source: Great! You have a complete terminal database! All your keys work well.
uk: Чудово! У вас ╓ повна база опис╕в терм╕нал╕в! Вс╕ ваш╕ клав╕ш╕ працюють добре.

source: Learn keys
uk: Розп╕знавання клав╕ш

source: Press all the keys mentioned here. After you have done it, check
uk: Натисн╕ть вс╕ перерахован╕ вище клав╕ш╕. П╕сля натиснень знайд╕ть,

source: which keys are not marked with OK. Press space on the missing
uk: т╕, що не мають позначки √. Для розп╕знавання клав╕ш╕

source: key, or click with the mouse to define it. Move around with Tab.
uk: вибер╕ть ╖╖ за допомогою Tab чи мишою ╕ натисн╕ть пропуск.

source: The Commander can't change to the directory that the subshell claims you are in. Perhaps you have deleted your working directory, or given yourself extra access permissions with the "su" command?
uk: Неможливо перейти в каталог, про який пов╕домив ╕нтерпретатор команд. Може, ви видалили робочий каталог чи дали соб╕ додатков╕ права доступу за допомогою команди "su"?

source: Press any key to continue...
uk: Для продовження натисн╕ть будь-яку клав╕шу...

source: The shell is already running a command
uk: ╤нтерпретатор вже викону╓ команду

source: The Midnight Commander
uk: Midnight Commander

source: Do you really want to quit the Midnight Commander?
uk: Ви справд╕ хочете вийти з Midnight Commander?

source: Listing format edit
uk: Виправлення формату списку

source: &Listing mode...
uk: Параметри &списку...

source: &Quick view C-x q
uk: &Швидкий перегляд C-x q

source: &Info C-x i
uk: &╤нформац╕я C-x i

source: &Sort order...
uk: Параметри &сортування...

source: &Filter...
uk: &Ф╕льтр...

source: &Network link...
uk: &Мережевий зв'язок...

source: FT&P link...
uk: &FTP-зв'язок...

source: SM&B link...
uk: &SMB-зв'язок...

source: &Drive... M-d
uk: &Пристр╕й... M-d

source: &Rescan C-r
uk: &Пересканувати C-r

source: &User menu F2
uk: Меню &користувача F2

source: &View F3
uk: &Переглянути F3

source: Vie&w file...
uk: Пере&глянути файл...

source: &Filtered view M-!
uk: &Ф╕льтрований перегляд M-!

source: &Edit F4
uk: &Редагувати F4

source: &Copy F5
uk: &Скоп╕ювати F5

source: c&Hmod C-x c
uk: Зм╕на &прав C-x c

source: &Link C-x l
uk: &Посилання C-x l

source: &SymLink C-x s
uk: &Символьне посилання C-x s

source: edit s&Ymlink C-x C-s
uk: &Зм╕нити символьне посилання C-x C-s

source: ch&Own C-x o
uk: Зм╕нити власника C-x o

source: &Advanced chown
uk: &Розширена зм╕на власника
